src/cf/Documents/ЗаписиУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаписиУСН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПримененныеВычетыПоНДФЛ</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
				<xr:Item>AccumulationRegister.НДФЛДоходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаписей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаписейФормированийКУДиР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОЗачетеВСчетПредстоящейОбязанности</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеМесяца</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоЕдиномуНалоговомуСчету</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбИсчисленныхСуммахНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаписиКУДиР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходБаза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходБаза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервичныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеЗапасов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаписиУСН</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеЗапасов</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.СборкаЗапасов</v8:Type>
								<v8:Type>cfg:DocumentRef.РаспределениеЗатрат</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходыПредпринимателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
								<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.УведомлениеОбИсчисленныхСуммахНалогов</v8:Type>
								<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВзносыПодлежащиеУплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВзносаПодлежащегоУплате</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыФиксированныхВзносовПодлежащихУплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикПоОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодПризнания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнеоборотныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/ВидыЗаписейФормированийКУДиР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыЗаписейФормированийКУДиР</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасходыНаТовары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаОплатуТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаОСиНМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПрочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыОтТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыОтУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыПрочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучныеЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаСтраховыеВзносы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаТаможенныеПлатежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаВзносыПодлежащиеУплатеИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыЕНП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ЗаписиУСН/Forms/ФормаЗаписиКУДИР/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = КонецКвартала(ТекущаяДатаСеанса());
		Объект.ВидЗаписей = Перечисления.ВидыЗаписейФормированийКУДиР.РучныеЗаписи;
		ДокументыЗаПериод = Параметры.ДокументыЗаПериод;
		Если ЗначениеЗаполнено(Параметры.Организация) Тогда
			Объект.Организация = Параметры.Организация;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидЗаписей = Перечисления.ВидыЗаписейФормированийКУДиР.РучныеЗаписи Тогда
		Элементы.ГруппаПредупреждения.Видимость = Ложь;
	Иначе
		ТолькоПросмотр = Истина;
	КонецЕсли;
	НомерСтроки = Параметры.НомерСтроки;
	Если Объект.ЗаписиКУДиР.Количество() > 0 Тогда
		РабочаяСтрока = Объект.ЗаписиКУДиР[НомерСтроки-1];
		ДоходыВсего = РабочаяСтрока.ДоходВсего;
		Доходы = РабочаяСтрока.ДоходБаза;
		ДоходыНДС = РабочаяСтрока.ДоходВсего - РабочаяСтрока.ДоходБаза;
		РасходыВсего = РабочаяСтрока.РасходБаза + РабочаяСтрока.НДС;
		Расходы = РабочаяСтрока.РасходБаза;
		РасходыНДС = РабочаяСтрока.НДС;
		ДатаПервичногоДокумента = РабочаяСтрока.ДатаПервичногоДокумента;
		НомерПервичногоДокумента = РабочаяСтрока.НомерПервичногоДокумента;
		Содержание = РабочаяСтрока.Содержание;
		ПервичныйДокумент = РабочаяСтрока.ПервичныйДокумент;
	КонецЕсли;
	
	ТекущийМесяц = ?(ЗначениеЗаполнено(ДатаПервичногоДокумента),
		НачалоМесяца(ДатаПервичногоДокумента), НачалоМесяца(Объект.Дата));
	ОбновитьМесяцыБезНДС();
	
	Элементы.ПервичныйДокумент.Видимость = ЗначениеЗаполнено(ПервичныйДокумент);
	
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Объект.ВидЗаписей = Перечисления.ВидыЗаписейФормированийКУДиР.РучныеЗаписи Тогда
		ПроверяемыеРеквизиты.Добавить("НомерПервичногоДокумента");
		ПроверяемыеРеквизиты.Добавить("ДатаПервичногоДокумента");
		ПроверяемыеРеквизиты.Добавить("Содержание");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Ссылка.Пустая() Тогда
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РабочаяСтрока = Неопределено;
	Если ТекущийОбъект.ВидЗаписей = Перечисления.ВидыЗаписейФормированийКУДиР.РучныеЗаписи Тогда
		// сохраняем ручные данные первой строки
		ТекущийОбъект.Дата = КонецКвартала(ДатаПервичногоДокумента);
		ТекущийОбъект.ЗаписиКУДиР.Очистить();
		РабочаяСтрока = ТекущийОбъект.ЗаписиКУДиР.Добавить();
	Иначе
		Если ТекущийОбъект.ЗаписиКУДиР.Количество() > 0 Тогда
			РабочаяСтрока = ТекущийОбъект.ЗаписиКУДиР[НомерСтроки-1];
		КонецЕсли;
	КонецЕсли;
	
	Если РабочаяСтрока <> Неопределено Тогда
		РабочаяСтрока.ДоходВсего = ДоходыВсего;
		РабочаяСтрока.ДоходБаза = Доходы;
		РабочаяСтрока.РасходВсего = РасходыВсего;
		РабочаяСтрока.РасходБаза = Расходы;
		РабочаяСтрока.НДС = РасходыНДС;
		РабочаяСтрока.ДатаПервичногоДокумента = ДатаПервичногоДокумента;
		РабочаяСтрока.НомерПервичногоДокумента = НомерПервичногоДокумента;
		РабочаяСтрока.Содержание = Содержание;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьНастройкиНалогообложенияНДС();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПервичногоДокументаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ДатаПервичногоДокумента) Тогда
		НовыйМесяц = НачалоМесяца(ДатаПервичногоДокумента);
	Иначе
		НовыйМесяц = НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса());
	КонецЕсли;
	
	Если НовыйМесяц <> ТекущийМесяц Тогда
		ТекущийМесяц = НовыйМесяц;
		ОбновитьНастройкиНалогообложенияНДС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПриИзменении(Элемент)
	ОбновитьДоходыВсего();
КонецПроцедуры

&НаКлиенте
Процедура ДоходыНДСПриИзменении(Элемент)
	ОбновитьДоходыВсего();
КонецПроцедуры

&НаКлиенте
Процедура РасходыПриИзменении(Элемент)
	ОбновитьРасходыВсего();
КонецПроцедуры

&НаКлиенте
Процедура РасходыНДСПриИзменении(Элемент)
	ОбновитьРасходыВсего();
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйДокументНажатие(Элемент, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(ПервичныйДокумент) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение( , ПервичныйДокумент);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьФормуДляРедактирования(Команда)
	
	ТолькоПросмотр = Ложь;
	Элементы.ГруппаПредупреждения.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗапись(Команда)
	
	Если НомерСтроки <> 0 Тогда
		УдалитьЗаписьСервер();
		Оповестить("ИзмененыЗаписиКУДИР");
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДоходыВсего()
	ДоходыВсего = Доходы + ДоходыНДС;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРасходыВсего()
	РасходыВсего = Расходы + РасходыНДС;
КонецПроцедуры
	
&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементов() 
	
	Элементы.ГруппаРежимы.ТекущаяСтраница = Элементы.ГруппаРучная;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Элементы.ДоходыВсего.Видимость = ЗначениеЗаполнено(ДоходыВсего) ИЛИ ЗначениеЗаполнено(Доходы);
		Элементы.РасходыВсего.Видимость = ЗначениеЗаполнено(РасходыВсего) ИЛИ ЗначениеЗаполнено(Расходы);
	КонецЕсли;
	
	УстановитьОформлениеПолейНДС();
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеПолейНДС()
	
	Если МесяцыДоходыБезНДС.Количество() = 0 И МесяцыРасходыБезНДС.Количество() = 0 Тогда
		Элементы.ДоходыНДС.Видимость = Ложь;
		ДоходыНДС = 0;
		Возврат;
	КонецЕсли;
	
	Элементы.ДоходыНДС.Видимость = Элементы.ДоходыВсего.Видимость;
	Элементы.ДоходыНДС.ТолькоПросмотр = Элементы.Доходы.ТолькоПросмотр;
	
	Если Элементы.РасходыВсего.Видимость Тогда
		Элементы.РасходыНДС.Видимость = Истина;
		НачалоТекущегоМесяца = НачалоМесяца(ДатаПервичногоДокумента);
		Если МесяцыРасходыБезНДС.НайтиПоЗначению(НачалоТекущегоМесяца) = Неопределено Тогда
			Элементы.РасходыНДС.ЦветФона = Элементы.Расходы.ЦветФона;
		Иначе
			Элементы.РасходыНДС.ЦветФона = Элементы.РасходыВсего.ЦветФона;
		КонецЕсли;
	Иначе
		Элементы.РасходыНДС.Видимость = Ложь;
	КонецЕсли;
	Элементы.РасходыНДС.ТолькоПросмотр = Элементы.Расходы.ТолькоПросмотр;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьСервер()
	
	РабочаяСтрока = Объект.ЗаписиКУДиР[НомерСтроки - 1];
	Объект.ЗаписиКУДиР.Удалить(РабочаяСтрока);
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиНалогообложенияНДС()
	
	ОбновитьМесяцыБезНДС();
	УстановитьОформлениеПолейНДС();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьМесяцыБезНДС()
	
	МесяцыДоходыБезНДС.Очистить();
	МесяцыРасходыБезНДС.Очистить();

	МесяцыИсключенияНДС = Документы.ЗаписиУСН.МесяцыИсключенияНДСИзДоходовРасходов(Объект.Организация,
		НачалоГода(ТекущийМесяц), КонецГода(ТекущийМесяц));

	МесяцыДоходыБезНДС.ЗагрузитьЗначения(МесяцыИсключенияНДС.МесяцыДоходыБезНДС);
	МесяцыРасходыБезНДС.ЗагрузитьЗначения(МесяцыИсключенияНДС.МесяцыРасходыБезНДС);
	
КонецПроцедуры

#КонецОбласти
